# Data Manipulation - Pandas and Numpy
### Series

In [1]:
import pandas as pd
import numpy as np

In [2]:
numeros = pd.Series([1,2,3,4,5,6,7,8,9,10,11,12])

In [3]:
numeros.index

RangeIndex(start=0, stop=12, step=1)

In [4]:
meses = ['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho', 'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro']

In [5]:
meses_rs = pd.Series(np.arange(1, 13), index=meses)

In [6]:
meses_rs

Janeiro       1
Fevereiro     2
Março         3
Abril         4
Maio          5
Junho         6
Julho         7
Agosto        8
Setembro      9
Outubro      10
Novembro     11
Dezembro     12
dtype: int32

In [7]:
meses_rs.index

Index(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype='object')

In [8]:
new_meses = pd.Series([meses[x] for x in range(len(meses))], index=np.arange(1, 13))

In [9]:
new_meses

1       Janeiro
2     Fevereiro
3         Março
4         Abril
5          Maio
6         Junho
7         Julho
8        Agosto
9      Setembro
10      Outubro
11     Novembro
12     Dezembro
dtype: object

In [10]:
world_cup = {'Brasil': 5, 'Alemanha': 4, 'Itália': 4, 'Argentina': 2, 'Uruguai': 2, 'Inglaterra': 1, 'Franca': 1}

In [11]:
world_cup

{'Brasil': 5,
 'Alemanha': 4,
 'Itália': 4,
 'Argentina': 2,
 'Uruguai': 2,
 'Inglaterra': 1,
 'Franca': 1}

In [12]:
pd.Series(world_cup)

Brasil        5
Alemanha      4
Itália        4
Argentina     2
Uruguai       2
Inglaterra    1
Franca        1
dtype: int64

In [13]:
world_cup_sr = pd.Series(
    world_cup,
    index = ['Brasil', 'Alemanha', 'Itália', 'Argentina', 'Inglaterra', 'Espanha'],
    name = 'wcSeries')

In [14]:
world_cup_sr

Brasil        5.0
Alemanha      4.0
Itália        4.0
Argentina     2.0
Inglaterra    1.0
Espanha       NaN
Name: wcSeries, dtype: float64

In [15]:
world_cup_sr.Espanha = '1'

In [16]:
world_cup_sr

Brasil        5.0
Alemanha      4.0
Itália        4.0
Argentina     2.0
Inglaterra    1.0
Espanha       1.0
Name: wcSeries, dtype: float64

In [17]:
world_cup_sr['Paraguai'] = 0

In [18]:
world_cup_sr

Brasil        5.0
Alemanha      4.0
Itália        4.0
Argentina     2.0
Inglaterra    1.0
Espanha       1.0
Paraguai      0.0
Name: wcSeries, dtype: float64

In [19]:
path = 'data/Alunos.xlsx'

In [20]:
xls = pd.ExcelFile('dataset/Alunos.xlsx')

In [21]:
xls.sheet_names

['Alunos', 'Notas', 'Trimestre']

In [22]:
alunos = xls.parse('Alunos')
notas = xls.parse('Notas')
trimestre = xls.parse('Trimestre')
alunos.head()

   Alunos
0     Ana
1   Clara
2   Célia
3    João
4  Carlos

In [23]:
notas.head()

   Alunos  Notas
0     Ana    5.7
1   Clara    9.9
2   Célia    8.0
3    João    9.9
4  Carlos    7.0

In [24]:
trimestre.head()

   Alunos  Sobrenome  Mês 01  Mês 02  Mês 03
0     Ana     Santos     5.7     6.8     4.6
1   Clara      Mafra     9.9     7.0     9.0
2   Célia    Tavares     8.0     8.0     9.0
3    João      Nunes     9.9     9.0     8.0
4  Carlos  Guilherme     7.0     7.5     6.0

In [26]:
alunos.Alunos

0        Ana
1      Clara
2      Célia
3       João
4     Carlos
5      Jorge
6     Lilian
7    Antônio
Name: Alunos, dtype: object

In [30]:
trimestre['Mês 01'][0]

5.7

In [31]:
trimestre.index

RangeIndex(start=0, stop=8, step=1)

In [32]:
trimestre.columns

Index(['Alunos', 'Sobrenome', 'Mês 01', 'Mês 02', 'Mês 03'], dtype='object')

In [34]:
'joão' + ' ' + 'Numes'

'joão Numes'

In [35]:
trimestre['Nome Completo'] = trimestre.Alunos + ' ' + trimestre.Sobrenome

In [36]:
trimestre

    Alunos  Sobrenome  Mês 01  Mês 02  Mês 03     Nome Completo
0      Ana     Santos     5.7     6.8     4.6        Ana Santos
1    Clara      Mafra     9.9     7.0     9.0       Clara Mafra
2    Célia    Tavares     8.0     8.0     9.0     Célia Tavares
3     João      Nunes     9.9     9.0     8.0        João Nunes
4   Carlos  Guilherme     7.0     7.5     6.0  Carlos Guilherme
5    Jorge      Silva     6.8     7.0     5.0       Jorge Silva
6   Lilian     Vianna     7.8     8.0     8.5     Lilian Vianna
7  Antônio      Costa     7.0     6.5     6.0     Antônio Costa